import React, {useState} from "react";
import {View, StyleSheet} from "react-native";
import AppButton from "../AppButton";
import {THEME} from "../../../theme";
import {Path, Svg} from "react-native-svg";
import AppDialog from "../formUI/AppDialog";
import {AppTextBold} from "../AppTextBold";
import {AppText} from "../AppText";

export default ({onResult, priceIs = 0}) => {
    const [priceModal, setPriceModal] = useState(false)
    const [price, setPrice] = useState(priceIs)
    return (
        <>
            <AppButton
                color={THEME.FOOTER_BG}
                style={styles.btnPrice}
                onPress={() => {
                    setPriceModal(true)
                }}
            >
                <View style={{width: 28, height: 18}}>
                    <Svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <Path d="M10.1104 14.9554H10.4554V14.6104V13.6888C11.6183 13.3814 12.9392 12.4347 12.9392 10.7825C12.9392 9.62151 12.2513 8.88577 11.4369 8.37529C11.0316 8.12124 10.5832 7.91461 10.1522 7.73217C9.97585 7.65751 9.80631 7.58839 9.64277 7.52172C9.39619 7.42121 9.16326 7.32625 8.94126 7.22625C8.65582 7.08802 8.66316 6.93971 8.66874 6.91864C8.6766 6.88894 8.76706 6.71164 9.25239 6.68541L9.25239 6.68543L9.25672 6.68515C9.95919 6.63831 10.7106 6.88253 11.281 7.06793C11.3562 7.09239 11.4283 7.11582 11.4968 7.13743L11.8341 7.24395L11.9321 6.90406L11.6006 6.80844L11.9321 6.90404L11.9322 6.90399L11.9322 6.90377L11.9325 6.90294L11.9334 6.89965L11.9371 6.88682L11.9512 6.8379L12.0021 6.66073C12.0446 6.51263 12.1022 6.31146 12.1626 6.09927C12.2824 5.67826 12.4158 5.20408 12.4613 5.02199L12.5396 4.70868L12.2322 4.60986C11.7976 4.47016 11.2719 4.37184 10.8704 4.30249C10.7912 4.28881 10.7178 4.27642 10.6506 4.26507C10.5784 4.25288 10.5132 4.24188 10.4554 4.23173V3.36039V3.01539H10.1104H7.86039H7.51539V3.36039V4.3572C6.97313 4.60511 6.44324 5.01684 6.03276 5.4752C5.57484 5.98655 5.20695 6.62237 5.20695 7.21753C5.20695 8.54159 6.05428 9.2997 6.92318 9.75168C7.35707 9.97739 7.81145 10.1361 8.19653 10.2584C8.31953 10.2975 8.43167 10.3318 8.53309 10.3629C8.76653 10.4345 8.94313 10.4886 9.06443 10.5425L9.06626 10.5433C9.48222 10.7253 9.46854 10.891 9.46665 10.9027C9.45936 10.9477 9.3756 11.1008 9.04661 11.1752C8.66391 11.2481 8.18031 11.2014 7.66616 11.0852C7.15598 10.9698 6.64738 10.7937 6.2295 10.6352L5.89349 10.5078L5.77985 10.8487L5.16621 12.6896L5.07445 12.9649L5.32994 13.1025C5.75076 13.3291 6.38073 13.5131 6.87357 13.6436C7.03222 13.6856 7.18612 13.7244 7.31677 13.7573C7.3899 13.7757 7.45575 13.7923 7.51108 13.8066C7.51253 13.807 7.51396 13.8074 7.51539 13.8077V14.6104V14.9554H7.86039H10.1104ZM0.345 9C0.345 4.22301 4.22301 0.345 9 0.345C13.777 0.345 17.655 4.22301 17.655 9C17.655 13.777 13.777 17.655 9 17.655C4.22301 17.655 0.345 13.777 0.345 9Z" stroke="white" stroke-width="0.69"/>
                    </Svg>
                </View>
                <AppTextBold style={{marginTop: 0, marginBottom: 0}}>
                    {price}₽
                </AppTextBold>

            </AppButton>
            {
                priceModal
                    ?
                    <AppDialog
                        title={"Введите стоимость участия"}
                        onResult={pr => {
                            if(onResult) onResult(pr)
                            setPrice(pr)
                        }}
                        onOk={() => {
                            setPriceModal(false)
                        }}
                    />
                    :
                    <></>
            }
        </>
    )
}

const styles = StyleSheet.create({
    btnPrice: {
        width: "auto",
        marginLeft: "auto",
        marginRight: "auto",
        alignItems: "center",
        justifyContent: "center"
    }
})